export const portfolioData = [
  {
    title: 'Многостраничный портал застройщика',
    url: 'uip'
  },
  {
    title: 'Приложение для терминала сбора данных для завода по заправке балонов',
    url: 'tsd'
  },
  {
    title: 'Многостраничный портал для «Института дополнительного профессионального образования»',
    url: 'dvipraz'
  },
  {
    title: 'Лендинг для сервиса StellarRDP — безопасного управления удалённым доступом через Remote Desktop Protocol',
    url: 'rdp-landing'
  },
  {
    title: 'Дашбоард для сервиса StellarRDP — безопасного управления удалённым доступом через Remote Desktop Protocol',
    url: 'rdp-dashboard'
  },
  {
    title: 'Международный оператор доставки посылок',
    url: 'dostav'
  },
  {
    title: 'Система учёта пассажиров бизнес зала международного авиатерминала',
    url: 'aeroakt'
  },
] as const;

