
import type { TimelineItemData } from "@shared/ui/sections/Timeline/Timeline.types";

export const listOfOtherJobs: TimelineItemData[] = [
  {
    title: 'Высшее образование переводчика',
    date: '2006 - 2012',
    description: `Обучение на переводчика развивает навыки чёткой коммуникации, межкультурной чувствительности`,
    status: 'calendar',
  },

  // , критического мышления, самообучения, стрессоустойчивости, внимания к деталям и быстрой обучаемости
  {
    title: 'Работа в MLM компании',
    date: '2006 - 2014',
    description: 'Научился принимать самостоятельные решения, коммуницировать, мотивировать людей, проводить выступления. Строил как международную команду через интернет (онлайн), так и локальную (оффлайн). Проходил курсы от компании: тим-билдинг, тайм-менеджмент, работа с возражениями, коммуникация с клиентами, маркетинг, маркетинг в интернете',
    status: 'calendar',
  },
  {
    title: 'Срочная служба в армии',
    date: '2012 - 2013',
    description: 'Кризисный жизненный урок, который научил меня находить общий язык с разными людьми, быстро адаптироваться к меняющимся обстоятельствам',
    status: 'calendar',
  },
  {
    title: 'Работа в аэропорту в информационном центре',
    date: '2013 - 2019',
    description: 'Развил высокие навыки клиенториентированного общения, быстрого решения проблем и многозадачности в условиях критических ситуаций. Проходил курсы от аэропорта, такие как психология пассажиров в критической ситуации, общение с пассажирами по схемам',
    status: 'calendar',
  },
  {
    title: 'Частная практика SMM продвижений',
    date: '2015 - 2017',
    description: 'Глубокое понимание поведения пользователей, умение создавать контент, который откликается аудитории, и навык анализа обратной связи для постоянного улучшения продукта, аналитики трендов и адаптации контента, использование инструментов продвижения',
    status: 'calendar',
  },
  {
    title: 'Частная языковая преподавательская практика',
    date: '2015 - 2025',
    description: 'Умение работать с людьми, находить методику преподавания, проявлять инициативу и разрабатывать свои курсы, изучать самому и объяснять другим систему иностранного языка',
    status: 'calendar',
  },
  {
    title: 'Работа в IT компании',
    date: `2023 - ${new Date().getFullYear()}`,
    description: 'Развитие самообучения, навыки коммуникации, критическое мышление, управление проектами и способность к междисциплинарному сотрудничеству, положительное отношение к критике',
    status: 'calendar',
  },
]
